[
  {
    "title": "5.0 out of 5 stars\n Well-received order",
    "body": "Read the previous reviews up until the latest ones, and i also received my bottle in good condition with no visible dents and colour is as shown on the pictures. Delivery took awhile to arrive (i guess we all know why), but something could be done better for the packing as it wasn't delivered in a bubble wrap packet or box for that matter. Could be improved to reduce plausible defects for future orders."
  },
  {
    "title": "5.0 out of 5 stars\n love it!",
    "body": "this is my 3rd owala, love how much liquid it can hold, the lightweight, the hours it can keep my drink cold and how easy to carry it around"
  },
  {
    "title": "4.0 out of 5 stars\n Poor mold quality",
    "body": "I really like the bottle but I'm so bothered by this plastic mark on the cap that really screams cheap mold. It's something that I expect a branded pricey bottle not to have."
  },
  {
    "title": "3.0 out of 5 stars\n Owala",
    "body": "Very satisfied with the product unfortunately it took more than a week to be delivered. Tracking was not accurate."
  },
  {
    "title": "4.0 out of 5 stars\n slight dents on my bottle",
    "body": "as someone who is easily influenced by tiktok, this is a great water bottle for your daily life with the option to sip or chug (dreamy fields, 32oz).\n\ni was honestly worried due to the reviews stating that their bottles came dented or scratched however, mine came with just wrapping, no bubble wrap and a box so there were smaller dents on the bottle."
  },
  {
    "title": "3.0 out of 5 stars\n Not packed properly",
    "body": "The bottle works well. No leakage, easy to wash, easy to drink. However, the body of the colour is much more “paler” than what was advertised. My only problem is with the way it was packed. Considering the fact that I’m a buyer from Singapore & this is being shipped from the US, I am well aware that my parcel is prone to being mishandled at any given time during shipping/delivery. This resulted in leaving a dent & small scratches on my bottle which is quite frustrating to see after opening my parcel. All these could’ve been avoided if Amazon US made the effort to at least wrap the bottle with a bubblewrap. My mistake was not to read the review before placing my order. I hope they take this into consideration as I saw there are quite a number of reviews stating the same issue."
  },
  {
    "title": "Me encantó",
    "body": "Llegó en una caja, bien protegido, sin ningún daño, lo amé, conserva mucho tiempo frío los líquidos y no derrama nada, el botón es muy resistente. Me encantó como se usa y el color también. Súper fan de Owala. Espero pronto agreguen más colores y ediciones especiales."
  },
  {
    "title": "best water bottle ever!!",
    "body": "it doesn't leak, it fits in my bag and my cup holder. It's a straw and can act as a normal water bottle i have drunk so much water since using this. :)"
  },
  {
    "title": "La amo, excelente calidad.",
    "body": "Soy fan de los termos, de todo tipo de termos, le estoy tomando mucho cariño, es práctica, fácil de usar y muy bonita."
  },
  {
    "title": "Super",
    "body": "Super beautiful and nice"
  },
  {
    "title": "Buena compra",
    "body": "Los colores varían ligeramente, pero aún así tiene linda presentación. Cumple con las características, mantiene el agua fresca por muchas horas. Tomar en cuenta que es más grande que una botella normal, no cabe en el compartimento del carro o a los costados de la mochila."
  },
  {
    "title": "New fave",
    "body": "."
  },
  {
    "title": "Amo mi owala",
    "body": "Gran compra 🫶 la botella es un poco pesada pero es muy fácil de llevar, recomiendo comprar la funda protectora, ya que en caso de golpes o ralladuras dependiendo del color si se notara.\nCompré el de 32 oz y siento que el tamaño es perfecto, dura el agua fría más de 24 horas."
  },
  {
    "title": "completely leak proof",
    "body": "Bottles often claim they are leak proof but this actually is!\nalthough it does dent easily"
  },
  {
    "title": "Justo lo que esperaba!!",
    "body": "Esta hermoso, muy buena calidad, Justo lo que anuncian y lo que esperaba"
  },
  {
    "title": "Amo mi owala!",
    "body": "Es el segundo owala que compro y la verdad es que me encantan estas botellas. Tienen un modelo muy único y facil de usar. Me gusta que tenga su popote incluido, es facil de limpiar. El tamaño es perfecto. Sella bien, por lo que no derrama liquidos por mas que lo voltees o muevas. Lo unico malo es que no trae incluido su calcetin abajo, por lo que recomiendo comprarle uno, porque si se te cae se puede abollar."
  },
  {
    "title": "The sip & chug option is awesome",
    "body": "I like that you can sip or chug. The sip is great in the current heat while driving as I can easily open the bottle with a click and sip without taking my focus off the road. My drink is kept cool & it's relatively easy to clean.\n\nThe cover is also nice and covers the drinking part well but keeping dust etc out. I've had to work at sites where there's people blasting frames in and their dust/chips get everywhere.\n\nWas thinking of getting the largest size but got the 2nd largest just cause it's lighter & easier to hold while still holding a decent amount of water for a day."
  },
  {
    "title": "Me encanto!",
    "body": "Segunda vez comprando esta marca y no me canso de ver los nuevos modelos y colores y diseños. Es excelente opcion."
  },
  {
    "title": "Damaged item",
    "body": "Damaged"
  },
  {
    "title": "Perfecto",
    "body": "Justo lo que esperaba, llego rapidísimo y en perfecto estado. El agua dura muchísimo fria"
  },
  {
    "title": "I LOVE MY OWALA!",
    "body": "I’ve always had the struggle of having an “everything bottle”. You know, the one where you can carry it with you, but also need to gulp it down after a workout. Other name brands have a straw and a gulp option, but not at the same time. If I wanted to gulp, I’d have to take the straw out and that’s annoying. BUT WAIT! Here comes in the Owala!\n\nPros:\n-straw built in\n-gulp option WITHOUT dealing with a straw… mind blown\n-I can throw it in my purse or gym bag with 0 spillage\n-I can fall asleep with it in my bed (hydrate or dydrate) and not have to worry about it spilling\n-easy to carry\n-cute colors!\n\nCons:\n-lol I can’t find one.\n\nI bought the boot so it’s not loud when I set it down on surfaces. Other than that, I love this bottle! Do yourself a favor and get one!!"
  },
  {
    "title": "Great for Work!",
    "body": "I splurged on myself and bought this Owala to use specifically at work. I am usually a brumate girl, and while I love their eras, I don’t like the exposed straw. I work in a hospital and the idea of having my straw out in the open grosses me out.\n\nI loved this cup because it closes up tight, you can drink it with a straw sip or drink it by tipping it back, and the colors are fun. Only thing I disliked is how long it stays cold as compared to the yeti I had before. I made the change from my yeti because I had to put a silicone straw in to drink from when I opened it if I wanted a straw, but I didn’t like the extra step I had to take to get a covered straw bottle. (I know that’s extra, but here we are) This, not only, addresses that concern, but also has the ability to tip back as well. Honestly I’m considering getting a small one for my daughter because she struggles with the concept of straw or tip back cups and, since this does both, I think it would address it. The color is a nice muted pink color and the purple accents helped. I got a boot to match and I’m thrilled with how it turned out! Honestly it makes me want to drink water more now!\n\nOverall, very happy with this purchase!"
  },
  {
    "title": "Fun, durable, functional, and no funky tasting water!",
    "body": "When I was pregnant with my second daughter I was surprised when my doctor advised me to not drink from plastic or cook with non-stick. I did some research and we made changes, including converting to stainless steel water bottles. It has been so hard to find a good water bottle that is all stainless steel and doesn’t leak. Klean Kanteen is decent, but the silicone inserts that seal the lid break down over time and literally shred apart. If I’m paying a premium price, I don’t want a water bottle with a short lifespan. ThermoFlask is another decent option, but we’ve had the same issue with the lid seal breaking down, and also the straws seem to wear out. They get sort of scuffed up and discolored, and by the end of the day the water starts to have a funny plastic taste. Makes me wonder what the heck I’m marinating in my water all day. So we decided to give Owala a try, and for us, these are the best option we’ve found so far. The bottle itself is insulated stainless steel, and only the lid and straw are plastic. But they seem to be “better” plastic = super hard and durable plastic, including the straw which is rigid and does not bend (ThermoFlask plastic straws bend). Maybe this type of plastic is more resistant to wear and tear, I’m not sure, all I know is that we can leave water in the bottles for DAYS and it still tastes just like water, no funky flavors. I can stick all parts in the dishwasher over and over again, including the straw, and they come out clean and looking brand new every time, without stains. The silicone insert that seals the lid seems to be better designed and more resistant to breaking down than Klean Kanteen and Thermoflask. My girls love all the different fun color options, it’s nice to be able to chug if you are super thirsty, or keep the bottle upright to take a sip from the straw. Especially for our youngest, the straw feature is essential. And the bottles can take a beating, we’ve dropped them on sidewalks, hardwood floors, concrete, etc and they are still going strong. A note on sizing, the 24 oz and 32 oz sizes are actually the exact same height, it’s just the 24oz is a little thinner. I’ve included side-by-side photos. There really is not much physical difference between these two capacities, so we bumped up to the 32 oz for my daughter who is in first grade, since she was running out of water by the end of the school day with the 24 oz. The 32 oz still easily fits in the side pocket of her backpack, and it’s enough water for her to get through the day. Bottom line - these water bottles are durable, they function great, and they keep our water cold and fresh and free of funky flavors. Until someone cracks the code for a durable, 100% all stainless-steel water bottle with a straw that doesn’t leak, these are the go-to in our household. Highly recommend."
  },
  {
    "title": "Absolutely in love.",
    "body": "Definitely my favorite bottle. I’ve had the 24oz Owala with a straw ( not sure what type that one is called ) but I love it! I felt like upgrading and getting a bigger bottle and I’ve always wanted the free sip.\n\nSo I decided to get the 32oz and the boot for it. And this bottle is wonderful! I haven’t used it for hot stuff but I have used it with little amounts of ice and it’s kept cold through the whole entire day. I love that you can sip through it or use the spout. Both are super convenient.\n\nNot to mention, they have beautiful colors to choose from. I got the dreamy field one and it’s so lovely.\n\nThere’s really no cons to this bottle at all.\nI was going to mention there’s no handle, but I do use the lock as the handle and it’s very sturdy (:\n\nIf I was in the need of getting more, I would absolutely get more."
  },
  {
    "title": "No complaints from this bottle collector!",
    "body": "I got this water bottle because my coworkers kept raving about it. I personally love my Simple Modern tumbler and have had Yeti and Stanley in the past as well but wanted something easy to carry to theme parks. I picked the Dusty Rose color and it definitely looks more white but I purchased knowing I was going to get stickers for it anyway. Water stays icy cold, SOOOO easy to drink from, and easily carried. Big fan!"
  },
  {
    "title": "Best water bottle!!",
    "body": "I've tried them all, cheap knock offs and expensive ones like Stanley, hydroflask, and so many others, and this is hands down the best water bottle!! I love that I can use it with the built-in straw or use it as a open water bottle just depending on how I tip it while drinking. It's seriously perfect. My husband has been using the Stanley for 4 years and switched to this after seeing mine. No more leaking, or spilling."
  },
  {
    "title": "Perfect!",
    "body": "I have a complete obsession with water bottles, coffee cups, etc. I am breastfeeding and needed/wanted something that was easier to drink than using a straw on my yeti all day long. I had this in my cart for weeks after doing research on great water bottles. I am so GLAD I bought it, I don’t think I even realized the features it came with! You can tip it back and use the open mouth for larger drinks AND it has a straw!!!! It’s worked wonders for me in my mom era. Looking at getting a smaller one soon, so that it fits in my car cup holder! But if you need a large one, it is for sure 100% leak proof, mine sits in the seat next to me, bottom of stroller and in the diaper bag!"
  },
  {
    "title": "Will never go back!",
    "body": "I see what the hype is about! The sip and swip lid is really convenient. It's also way easier to clean than other waterbottles. It keeps my water cold for a very long time! I have dropped it a few times and it did dent fairly easy on my first drop. It was only a small dent though and I would recommend this to anyone!"
  },
  {
    "title": "Great price and product",
    "body": "I ordered this for my daughter. She loves this cup. Product does not leak like it’s other expensive competitors. It has a straw function as well as a way to drink from the spout. Plus, the added cuteness of looking like a koala when you drink sold me. I would order these over a Stanley any day. Drinks stay cold for days."
  },
  {
    "title": "Better than a Stanley",
    "body": "Wanted something that would keep my kids water cold all day for school but wouldn’t leak. This has been the best purchase and I’ve tried them all! My kids love all of the color options and I love that the lid completely covers where they drink out of. I also like the built in straw that they can use if needed. This has held up perfectly through school, sports, and in and out of bags without leaking! Can throw it in the dishwasher to clean at the end of a long day."
  },
  {
    "title": "The best water bottle",
    "body": "This is my 2nd bottle as I had lost the 1st one. I love the design of the handle on the cap and that you can push it down to secure lock the open button. I also prefer the sip design as well as I do not want to deal with a straw on the outside of a bottle nor having to turn the bottle upside to drink out of it. The insulation on the bottle is great. I like to fill it up with ice and water and I have an ice cold drink for the rest of the day. This will keep cold all through the night as well if you don't drink water as quickly. I highly recommend Owala bottles!"
  },
  {
    "title": "BEST water bottle",
    "body": "This is my favorite water bottle, bar none. I have Swig, Swell, every brand made. But this is the best. It is leak proof, keeps water or tea cold for hours, very pretty, and I love the top. You can gulp or use the built in straw. The only negative is it doesn’t fit in the cup holder in my car. Not a big enough negative for me."
  },
  {
    "title": "Found my forever bottle!!",
    "body": "I absolutely love this bottle!! This is the 34 oz bottle and I recently received a 24 oz bottle. I’ve looked long and hard for a bottle that checked off all my boxes. I’m going to go through those step by step.\n\nThis bottle has a protective push-to-open lid. This has been the toughest to find. I work in the public school system and germs are continuously airborne so a completely protected mouth piece was huge. The locking cap completely enclosed the mouthpiece then locks so the isn’t leakage.\n\nI love a water bottle with a straw but Owala gives you the best of both worlds with their FreeSip spout!! You can use the built in straw OR you can told it back to take a long hard swig.\n\nThe double wall stainless steal insulation Owala offers keeps my ice frozen for 24 hours! Which keeps my drink icy cold day and night. I don’t have to take an extra bag of ice with me when I’m out for the day, simply working or watching my grandchildren play soccer.. This is a huge advantage to me.\n\nEasy to clean. The straw easily removes from the mouthpiece for easy cleaning. The lid can go into the dishwasher and simply hand wash the bottle.\n\nI am sold on this bottle!! 5 ⭐️⭐️⭐️⭐️⭐️"
  },
  {
    "title": "It’s great but…",
    "body": "I really like it and the features are great. I like that you can choose to chug it or sip from the bottle and that you can lock the bottle so it doesn’t spill. I can bring it everywhere and it carries a good amount of water. The only thing i don’t like about it is that it doesn’t keep my water cold as long as i want it to, and it chips really easily so if you accidentally drop it or scratch it, it is probably going to be noticeable."
  },
  {
    "title": "Best water bottle ever!!!",
    "body": "I’m so serious when I say this is great. I’ve tried ALL the big fancy water bottles and Spent so much money on them all just to end up mainly using my Owala. I love having the choice between the straw and the chug bit. I drink A LOT of ice water so having something to keep my ice from melting is very important and this does it pretty well. I noticed if I rattle the bottle around a lot the ice melts quicker but I’ve noticed that with every insulation bottle I own. Bottle feels pretty nice over all just make sure u get one of those rubber boots for the bottom to avoid dents !!! Oooh and IT DOESNT LEAK AT ALL I left it in my bag during a hike and ice was still there and no water spilled in my bag!!!!"
  },
  {
    "title": "Great water bottle",
    "body": "This came quickly and was in great condition. These are wonderful bottles. Keeps beverages cold for a long time, allows for both straw and chug drinking and is leakproof. My favorite feature is that the drinking area is covered when not in use, I get grossed out with an exposed straw on cups."
  },
  {
    "title": "Mainly loved with",
    "body": "Ok I do really love this water bottle, but there are a couple things I don’t like. It’s rather large so it doesn’t fit in a cup holder, which I did expect, but that means sometimes it ends up on the side and it does like. Also I ordered the pink one (dusty field or something was the official color) and the photo shows that it’s very pink. I either got sent the wrong color, or the photo is very wrong because it’s more of an off white."
  },
  {
    "title": "Increíble",
    "body": "Me encantó la vrdd si esta un poquito pesado, pero ya poniéndole lo de la agarradera lo puedes transportar súper bien 🩷, una muy buena compra"
  },
  {
    "title": "Great cup!!",
    "body": "I've named this the perfect \"adult sippy cup\"... If I can't drop it and it be ok, I probably shouldn't have it. I've dropped mine...a lot over the last couple years... DURABLE!\n\nWe've had this brand for a couple years now. They're durable, stay closed, and stay cold."
  },
  {
    "title": "Cute and functional",
    "body": "This water bottle is cute. My boyfriend got me the 32oz. The color block is so pretty. It's hygienic with the straw being covered. The fact that it locks is wonderful as well I enjoy that feature as it doesn't leak at all an it's handle to carry around. The 32 Oz doesn't fit in the a car cup holder. I just flip it onto the top an it works there 😆 it keeps cold all day. As far as ice we'll I live in Cali and it get hot. I've had ice stay and not I think it's fine. It's easy to clean take all the parts off and dry and replace. Great buy an not too expensive."
  },
  {
    "title": "The best cup!",
    "body": "I ordered this cup for a “favorite things party” and ended up liking the colors so much that I kept it for myself. ;) Love these Owala cups. I’ve also owned the Stanley flip straw tumblers, and these are way better in my opinion!"
  },
  {
    "title": "The new way to drink water!",
    "body": "The sip feature is really a new good technology that is spill-proof and leak-proof. The color of the bottle is white with a tinge of pink (still nice and pretty). The insulation is good and can last a long while, but I must say that I experienced longer/better insulation with another brand."
  },
  {
    "title": "Love this bottle!",
    "body": "Got this because the straw is covered and it is more sanitary for me to use at work. It’s leak and sweat proof which is great! Love the cute colors and different sizes but I do wish that it kept my water colder longer (it’s still great for a few hours) but doesn’t stay cold for as long as I would like. I already have a few scratches on the outside and have only had it a few weeks, but I got white so that is expected. Definitely worth the money I will buy again!"
  },
  {
    "title": "Spillproof",
    "body": "LOVE this water bottle. You can sip through the small opening or chug through the large one. And fill it without taking the lid off. Love the color too. I got size 32 oz."
  },
  {
    "title": "Love it so far!",
    "body": "I bought this water bottle to replace my brita water bottle where the clasp holding the cap down continued to break. So far i love this water bottle as it is functional and adorable."
  },
  {
    "title": "Color",
    "body": "Muy buen producto solo que se ve mas rosa en la foto, en realidad es más blanco."
  },
  {
    "title": "Really handy and pretty",
    "body": "I was hesitant buying this water bottle but I don’t regret a thing.\nThe color is beautiful and the size is perfect. Very comfortable and satisfying to drink out of"
  },
  {
    "title": "Liked it for awhile",
    "body": "I got one of these for my 14 year old niece for Christmas. I just found out that the lid broke after only having it for about a month. She loved it right up until then. Unfortunately, she didn’t realize I could have ordered her a new lid, so she just threw it away."
  },
  {
    "title": "Perfect",
    "body": "The Owala keeps my water cool for all day long, it feels sturdy on hand and it’s very comfortable to use specially drinking with the straw."
  },
  {
    "title": "LOVE LOVE LOVE",
    "body": "It’s been my favorite for the last couple of months. I was a little skeptical with the design but it’s very easy to use."
  },
  {
    "title": "Ditch your Stanley get this!!!",
    "body": "Better than a Stanley because it’s leak proof! I was over my Stanley spilling everywhere and tried the owala and I love this water bottle."
  },
  {
    "title": "Best water bottle!",
    "body": "This is the best water bottle I've ever had! My water intake increased because of this bottle! What a great invention!"
  },
  {
    "title": "My daughters favorite",
    "body": "So great, keep ice cold and has sipper or straw option. Doesn’t spill and easy to lock. Its great!!"
  },
  {
    "title": "Love it",
    "body": "Perfect for my water! 32oz is the way to go not too heavy like most and definitely doesn’t leak! Love it already"
  },
  {
    "title": "Easy access",
    "body": "Love this cup. Lid is easy to flip and I like that I’m not always sucking a straw causing more wrinkles."
  },
  {
    "title": "Awesome!",
    "body": "Like that I can sip or chug, easy to carry, love the colors! Better than Stanley! Great purchase."
  },
  {
    "title": "Best water bottle EVER!!",
    "body": "Stays cold forever, has never leaked, and had survived multiple mishaps with zero damage!"
  },
  {
    "title": "Leak proof!",
    "body": "No leaks, best color, holds a lot and the ice/water stays all night"
  },
  {
    "title": "If you have small hands it difficult to pick up.",
    "body": "Very round and fat. Couldn’t pick up with one hand. Beautiful colors, definitely leak proof."
  },
  {
    "title": "Teen gift",
    "body": "Teen gift and I got one for my daughter she loves, doesnt spill"
  },
  {
    "title": "Works great for school!",
    "body": "The color was pretty and was completely leakproof!"
  },
  {
    "title": "Best water bottle I have ever had",
    "body": "This really is leak proof. Easy to clean. Cute."
  },
  {
    "title": "Love it",
    "body": "Awesome water bottle."
  },
  {
    "title": "Cute color",
    "body": "Keeps water cool"
  },
  {
    "title": "Looks nicer in person, wish it wasn’t as wide",
    "body": "Great water bottle. The straw function is the best one I’ve ever used in one of these stainless steel style water bottles (and I’ve used ones that cost from $15-50). It is heavy with the full 32 oz. of water in it and the bottle is wider than I’d like. However, it checks other more important things off for me so I don’t see myself needing to return this. Doesn’t leak, looks nice, love the two drinking choices (gulp or straw), and it feels sturdy. I haven’t seen if it fits in my cup holder in my car or in either of our strollers though 🤔"
  },
  {
    "title": "Excelente producto",
    "body": "Muy buen producto. 10/10"
  },
  {
    "title": "Sooo good",
    "body": "I recently started using the Owala water bottle, and I have to say, it's been a game-changer! The design is sleek and ergonomic, fitting perfectly in my hand and cup holder. What truly impressed me is its durability – I've accidentally dropped it a few times, and it's held up like a champ without any dents or leaks. The built-in straw makes it super convenient to sip on the go, and the wide mouth allows for easy cleaning, ensuring my water always tastes fresh. Overall, I highly recommend the Owala water bottle to anyone looking for a durable, clean, and stylish hydration solution."
  },
  {
    "title": "My new bottle 🐨💜",
    "body": "Do you know when you drink it, your nose will be like Koala 😆 haha!\n\nI actually love the bottle and it’s worth the hype tbh. The body just make it easier to bring out everywhere and maybe in the bag or backpack.\n\nAs someone who work outside this bottle help to support me to stay hydrated!! Love this one and it’s multifunction. You can sip it or use with the straw!"
  },
  {
    "title": "LOVE LOVE LOVE",
    "body": "I don't write this lightly. I love this bottle. I have already ruined one laptop because of a leaky water bottle. NOT this one! I love the security of the locking mechanism. I really like the optional straw. I'm not a big straw person but having that option is really nice. Just a great water bottle."
  },
  {
    "title": "Obsessed",
    "body": "Never got on the Stanley train? Never switched from your 10 year old water bottle and it has finally kicked? Enter Owala. Definitely getting pretty popular now, but it’s worth the hype. The sip/gulp straw is amazing. I love that it doesn’t spill and is completely sealed. The handle up top makes it easy to grab and go. Would definitely recommend"
  },
  {
    "title": "Sure it’s pricey, but it does NOT LEAK!!",
    "body": "I can flip the water bottle upside down and shake it while it’s closed, and it does not leak whatsoever! I love the 32oz size and the colors are beautiful! Very sturdy and easy to carry! Super easy to clean! Easy to fill up since you don’t need to take the top off to fill it. Also very easy to drink from!!"
  },
  {
    "title": "Tomar con o sin pitillo?",
    "body": "Mantiene el frío por mucho tiempo, los hielos me duran casi un día antes de derretirse. Como el pitillo está escondido, no hay posibilidad de contaminación cruzada de ninguna forma.\nEl tamaño es perfecto para no perderlo de vista, y si te la pasas por fuera de la casa todo el día. Es fácil de lavar, y no se quedan los olores dentro de la botella después de lavarla."
  },
  {
    "title": "Leak proof, easy to handle tumbler",
    "body": "Happy about this purchase! Cute colors. True leak proof, easy to drink to - multiple styles of drinking. Easy to clean as well. Hope they can develop a steel straw in the future and more colors. It also keeps ice long for about 24 hrs. Was also shipped and delivered earlier than expected. Thank you!"
  },
  {
    "title": "Perfect for healthcare workers",
    "body": "I work in an er and I need a water bottle that’s easy to carry around with me, quick and easy to drink from and keeps the straw covered so I don’t get every single germ in the air and we aren’t suppose to have open straws."
  },
  {
    "title": "Great water bottle 4/5⭐️",
    "body": "This is definitely one of the best water bottles I’ve had but the button to open the top definitely needs some improvement. After a few days the button started to stick and after the few weeks I’ve had it, it barely opens by itself. I have to help pop the lid all the way open. If this wasn’t an issue I’d give it a 5/5 ⭐️"
  },
  {
    "title": "Excelente, me encantó.",
    "body": "Dude en comprarlo ya que en fotos de comentarios se veía casi blanco, igual y el video no le hace tanta justicia al color, yo lo veo como un lila/rosa muy claro, pero para nada es blanco, me encantó fa la combinación de colores con negro y morado, el tamaño es perfecto para llevarlo a la universidad, ya que no es enorme, lo puedes tomar con una mano y no hace mucho peso. Escogí esta marca y modelo por sobre los demás, ya que el hecho de que tenga popote escondido lo hace excelente! Siempre me a gustado tapar los popotes para evitar bichos y basurita que le pudiera caer, así que es una excelente opción, siento que es más una botella para llevar quizá a la escuela o trabajo, pero solo unas pocas horas, ya que su contenido es de casi 1L (32 OZ), me gustaría la opción más grande para mantenerlo en mi casa o viajes largos, pero para salidas cotidianas esta opción es perfecta! Pero si eres alguien que toma mucha agua, quizá una opción más grande sería perfecta para ti!"
  },
  {
    "title": "New favorite water bottle",
    "body": "I am obsessed with this water bottle. It is one of my fav purchases. Love that it has a straw feature and a sipping feature with a lid that covers the mouth piece."
  },
  {
    "title": "Best Water bottle so far!",
    "body": "Out of all the popular brand water bottles that I have owned, this is my favorite! Not only is the aesthetic right on point, it is comfortable to hold, easy to carry, has a lid that locks in place, and spill proof. I love that it has a built-in wide straw. I don't feel like my cheeks are squishing together as it does with a typical straw. Very easy to clean and keeps my drinks cold for a long time. Would recommend to anyone in the market!"
  },
  {
    "title": "Great cup",
    "body": "Love this water bottle. Way better then the Stanley. I can close the top and throw in bag. No spills or leaks. Keeps my drinks cold all day."
  },
  {
    "title": "Love it but had to exchange because they came dented.",
    "body": "Ordered 2 different colors, 1 was fine, but the other came dented. There was no box or bubble wrap to protect it. Amazon sent a new one but that one was dented too. I had to keep it because I needed it for a trip and didn’t have time to exchange again."
  },
  {
    "title": "Just ok",
    "body": "I am just ok with this water. Love the straw and chug feature, but the bottle is too big for car cup holder. It is also just big for me to hold. But I am not a big person. Would rather this be slimmer and taller."
  },
  {
    "title": "Best water bottle I’ve had in years",
    "body": "Really good quality and keeps my water cold all day, more points for the colourway 10/10"
  },
  {
    "title": "I’m loving this bottle",
    "body": "I am not a water drinker but I’m working on it- this one is my favorite."
  },
  {
    "title": "Love it!",
    "body": "Beautiful cup that works so well. It keeps my ice in my water all day!"
  },
  {
    "title": "favorite water bottle",
    "body": "This is my second Owala purchase. These are the best water bottles."
  },
  {
    "title": "Absolutely love it!",
    "body": "Never had a water bottle i loved so much from the get go. I always had to grow on a bottle because i didnt feel as comfortable with it. But this is AMAZING! I have been recommending it to everyone! I got the 32oz and it is not too heavy when full so great for travel. It is leak proof and love the dual feature of being able to use the straw function or regular drinking.\n\nAbsolutely love it!"
  },
  {
    "title": "Great",
    "body": "Only negative is it doesn’t fit in my car cup holder"
  },
  {
    "title": "Useful",
    "body": "Very comfortable, easy to clean and use."
  },
  {
    "title": "Sturdy",
    "body": "I love this thing"
  },
  {
    "title": "Love",
    "body": "My favorite water bottle"
  },
  {
    "title": "Perfect",
    "body": "I love this bottle. Drinking is amazing! 100% recommandation. Money worth!"
  },
  {
    "title": "like but....",
    "body": "I like this bottle but it doesn't fit in my car (Ascent) cup holders. I should of gotten the size down."
  },
  {
    "title": "Love it",
    "body": "Love the straw feature!"
  },
  {
    "title": "Very cute!",
    "body": "Loved this colour and great water bottle! Lost one star as they're a bit too expensive though."
  },
  {
    "title": "Exactly what you need it to be!",
    "body": "Ice was barley melted after leaving ice water in hot car for 8 hours. The handle makes it easy to carry while out hiking. I bought the medium size, it is quite big. The sip spout is genius."
  },
  {
    "title": "Perfect for working in a medical setting",
    "body": "I love the covered mouthpiece, and the fact you never have to touch anywhere near where your mouth goes! From a health care perspective, this is perfect for shifts, super good at keeping my water cold!\nI love the sip/chug feature, I haven't loved a water bottle ever as much as this one, comes with me everywhere and it is very durable! I love the lock feature, makes it so easy to just throw it in your bag and not be scared its going to open up and spill water on your laptop/ipad."
  },
  {
    "title": "LOVE THIS WATERBOTTLE!",
    "body": "I'm so happy I bought this water bottle. Ordered and it delivered in four days.\nSuper easy to clean and assemble. Love that the 32 oz isn't massive but enough.\nI love the color and design -- especially since it is leak proof & the spout is covered.\nI bought the matching bottle boot for it and it's freaking cute.\nI own a Stanley tumbler 40 oz but definitely switching over to OWALA! <3"
  },
  {
    "title": "Forget Stanley",
    "body": "literally the perfect water bottle for office, commute, and gym. It's lightweight so I don't mind lugging it on the bus to work and keeps my ice cold while I am running around the office. At the gym the easy sip straw feature makes it so much quicker to use during a workout. Since the straw is contained you never need to worry about getting poked in the eye or anything gross clogging it."
  },
  {
    "title": "Best tumbler",
    "body": "Best tumbler, can sip or chug. The straw has a cover which is good for traveling. I have different brands of tumbler but this is definitely my favorite. I don’t have to worry about my kids chewing the straw. It also keeps drinks cold for more than 24 hrs. The cover spring broke after a months of use but it’s probably because I used it a lot."
  },
  {
    "title": "Like the straw",
    "body": "The straw and sip feature is great. The seal is good when closed. Good water bottle to throw in your bag and not worry about leaking. Unfortunately the 32 + ounces don’t fit into car cup holder but that’s okay for me. I have a 24ounce one too and that does fit into car cup holder. I would recommend anyways."
  }
]